class Uzb_language:

    class start:
        main = "<b>TayyorTaxi | Toshkent-Toshkent viloyati</b> ботига хуш келибсиз! \n\n" \
               "<b>«🚖 Ҳайдовчи топиш»</b> тугмасини босинг ва сизга қулай ҳайдовчиларни топинг!"
        start = "Xуш келибсиз!"

    class menu:
        passenger = "🚖 Ҳайдовчи топиш"
        spot = "📍 Мен жойдаман"
        information = "ℹ Ма’лумот"
        order = "🗓 Фаол буюртмаларим"
        driver = "🙋 Мен ҳайдовчиман"
        settings = "⚙ Созламалар"
        main_menu = "🏠 Бош саҳифа"
        online = "🚕 Йўловчилар керак"
        personal_cabinet = "🔑 Шахсий кабинет"
        change = "🔄 Йўловчи бўлиш"

    class information:
        about_us = "ℹ Хизмат ҳақида"
        how_to_use = "❓ Қандай фойдаланилади"
        feedback = "☎ Алоқа"
        rules = "Хизмат кўрсатиш қоидалари"

    class feedback:
        feedback = "Қуйидаги контактлар орқали биз билан боғланишингиз мумкин👇\n\n" \
                   "Телеграм:@tayyortaxitosh_aloqabot"

    class symbol:
        sum = 'сум'

    class url:
        class client:
            about_us = "https://telegra.ph/Hizmat-%D2%B3a%D2%9Bida-10-13"
            how_to_use = "https://telegra.ph/%D2%9Aandaj-fojdalaniladi-10-13"

        class driver:
            how_to_use = "https://telegra.ph/%D2%9Aandaj-fojdalaniladi-10-13-2"
            about_us = "https://telegra.ph/Hizmat-%D2%B3a%D2%9Bida-10-13-2"
            rules = "https://telegra.ph/Hizmat-k%D1%9Ersatish-shartlari-10-13"

    class buttons:

        class common:
            back = "⬅Ортга"
            cont = "➡Давом этиш"
            location = "📍 Менинг жойлашувим"
            order = "✅Буюртма бериш"
            phone = "📱Менинг рақамим"
            agree = "✅Тасдиқлаш"
            yes = "✅Тўғри"
            da = "✅Ҳа"
            no = "❌Йўқ"
            on_spot = "✅Ҳа, мен шу ердаман"

        class passenger:
            choose_more = "➡Яна танлаш"
            location = "📍 Ҳайдовчи йўлга чиқиш жойи"

        class driver:
            route_cancel = "❌Бекор қилиш"
            location = "📍 Жўнаш жойи"
            accept = "✅Қабул қилиш"
            reject = "❌Рад этиш"

        class cancel:
            client = "❌Буюртмани бекор қилиш"
            driver = "❌Бекор қилиш"
            driver_ok = "❌Барибир бекор қилиш"

        class personal_cabinet:
            class data:
                data = "✍Менинг ма’лумотларим"
                name = "Исмни ўзгартириш"
                phone = "Рақамни ўзгартириш"
                car = "Машинани ўзгартириш"
                model = "Моделни ўзгартириш"
                number = "Давлат рақамини ўзгартириш"
                color = "Рангини ўзгартириш"

            class wallet:
                wallet = "💳Баланс"
                balance = "Балансни тўлдириш"
                payme = "Payme"
                click = "Click"
                paynet = "Paynet"
                pay = "✅Тўлаш"

    class questions:

        class passenger:
            from_town = "Қаердан йўлга чиқасиз? 👇"
            location = "📍 Жойлашувингизни юборинг, сизга энг яқин бўлган ҳайдовчиларни йўлга чиқиш жойларини топамиз👇"
            from_spot = "🅿️ Йўлга чиқиш жойини белгиланг 👇"
            to_town = "Қаёққа кетяпсиз?👇"
            to_spot = "🅿️ Келиш жойини белгиланг 👇"
            places = "Йўловчилар сонини белгиланг 👇"
            phone = f'Телефон рақамингизни юборинг 👇\n\n' \
                    f'<b>«📱Менинг рақамим»</b> тугмасини босишингиз мумкин ёки қўлда ' \
                    f'киритишингиз мумкин: +998 ** *** ** **'
            auto = "Автомобил моделини танланг 👇"
            car = "Қуйидагилардан танланг 👇"

            drivers_rate = "⭐️Сафар қандай ўтди? Илтимос ҳайдовчига баҳо беринг. " \
                           "Хизматни сиз учун яхшироқ қилишга йўрдам берасиз."

        class driver:
            from_town = "Қаердан йўлга чиқасиз? 👇"
            location = "📍 Қаердан йўлга чиқасиз? Жойлашувни белгиланг 👇"
            from_spot = "🅿️ Йўлга чиқиш жойини белгиланг 👇"
            to_town = "Қаёққа кетяпсиз?👇"
            to_spot = "🅿️ Келиш жойини белгиланг 👇"
            price = "💺 Бир нафар йўловчи нархини белгиланг 👇"
            places = "Бўш жой сонини белгиланг 👇"
            time = "⏰ Жўнаш вақтини белгиланг 👇\n\n" \
                   "<i>❗ Фақат кевотган <b>12 соат</b> ичидаги вақтни белгилашингиз мумкин</i>"
            accept = "✅ Аризангиз қабул қилинди. Йўловчилар алоқага чиқканоқ сиз хабарнома оласиз.\n\n" \
                     "⚠️Мижозлар учун фаол бўлишни тўхтатиш ёки маршрут параметрларини ўзгартириш учун " \
                     "<b>«🚕 Йўловчилар керак»</b> тугмасини босинг"
            change = "Ҳақиқатан ҳам йўловчи бўлмоқчимисиз?\n\nСизнинг маълумотларингиз сақланади"
            sure = "Ҳақиқатан ҳам фаолиятингизни бекор қилмоқчимисиз? " \
                   "Бу маршрутда энди янги буюртмаларни олмайсиз."

        class registration:
            name = "Ҳайдовчи бўлиш учун сиз кичик рўйхатдан ўтишингиз керак, ундан кейин сиз фаол ва " \
                   "<b>💵 50 000</b> сўм бонусга эга ҳайдовчи бўласиз!\n\n " \
                   "Исмингизни киритинг 👇\n\n Уни йўловчилар коришади"
            auto = "Автомобилингиз моделини танланг 👇"
            number = "<b>Автомобилнинг давлат рақамини киритинг ушбу форматда:</b>\n\n" \
                     "01A123BC\n" \
                     "01123ABC\n" \
                     "01H123456\n\n" \
                     "⚠️Маълумот хизматдан ташқари ҳеч қаерга узатилмайди фақатгина ҳайдовчи билан " \
                     "йўловчини учрашувини осонлаштириш учун керак"
            color = "Машинани рангини танланг 👇"
            phone = f'Йўловчилар билан уланиш учун телефон рақамингизни жўнатинг 👇\n\n' \
                    f'<b>«📱Менинг рақамим»</b> тугмасини босишингиз мумкин ёки қўлда киритишингиз мумкин: +998 ** *** ** **'
            agreement = "Ҳаммаси тўғрими? 👇\n\n<b>«✅Тўғри»</b>, тугмасини босиш орқали сиз хизмат кўрсатиш шартлари " \
                        "билан танишганингизни ва розилигингизни тасдиқлайсиз - 👉'"
            how_to_use = "❓ Қандай фойдаланилади"
            rules = "Хизмат кўрсатиш қоидалари"

    class personal_cabinet:
        name = "Исмингиз"
        phone = "Телефон"
        car = "Машина"
        id = "ID"
        wallet = "Баланс"
        common = "Асосий"
        bonus = "Бонус"
        congratulation = "Табриклаймиз! Хизматда рўйхатдан ўтганингиз учун сизга 💵 <b>50 000</b> сўм бонус берилди\n\n" \
                         "<b>❕Бонусдан фойдаланиш муддати - 20 кун</b>\n\n" \
                         "Аввал ма’лумотни кўриб чиқинг 👇"
        online = "Йўловчи буюртмаларини қабул қилишни бошлаш учун «🚕 Йўловчилар керак» тугмасини босинг👇"

    class chain:
        class passenger:
            from_place = "Қаердан"
            to_place = "Қаёққа"
            num = "Йўловчилар сони"
            distance = "📍 сиздан"

            car_find1 = "Сиз учун "
            car_find2 = "та машина мавжуд"
            car_not_found = "Афсуски, бу йўналишдаги автомобиллар ҳозирда топилмади, кейинроқ қайта уриниб кўринг."
            car_not_found2 = "Афсуски сиз белгилаган маршрутда ҳозирги пайтда ҳайдовчилар топилмади\n\n" \
                            "<b>🅿️ Сизга энг яқин кетиш нуқталарда ҳайдовчилар бор</b> 👇"

            driver = "Ҳайдовчи"
            car = "Модель"
            places = "Бўш жойлар"
            price = "1 йўловчи учун нарх"
            info = "Сизнинг маълумотларингиз"
            phone = "Телефон"
            time = "Жўнаш вақти"
            cost = "Умумий"
            passenger = "йўловчига"

        class driver:
            from_place = "Қаердан"
            to_place = "Қаёққа"
            places = "Бўш жойлар"
            price = "Умумий 1️⃣ йўловчига"
            price2 = "1 йўловчи"
            time = "Жўнаш вақти"
            alright = "Ҳаммаси тўғрими?"
            onepass = '1 йўл.'
            name = "Исмингиз"
            phone = "Телефон"
            info = "Йўловчини ма’лумотлари"
            spot = "📍 Сизнинг жўнаш жойингиз"
            car = "Модель"
            cost = "Умумий "
            passenger = "йўловчига"

        class personal_cabinet:
            change_name = "Исмни ўзгартириш"
            change_phone = "Рақамни ўзгартириш"
            change_car = "Машинани ўзгартириш"
            change_param = {'name': change_name, 'phone': change_phone, "car": change_car}
            new_data = "Янги ма’лумотни киритинг 👇"
            new_data_rec = "Ма’лумот ўзгартирилди."
            payment = "Тўлдириш миқдорини белгиланг 👇"
            pay_way = "Тўлов турини танланг 👇"
            amount = "Тўлов миқдори"

            pay_way2 = "Тўлов орқали"
            amount2 = "Тўлов миқдори"
            payment2 = '<i>Тўлов ўтқазиш учун <b>«✅Тўлаш»</b>  тугмасини босинг </i> 👇'
            accept = '✅Тўлов ўтқазилди\n\nБалансингизга киритилган миқдор'

    class order:
        active_orders = '<i>Буюртмангиз ҳолатини <b>«🗓 Фаол Буюртмалар»</b> саҳифасида кузатишингиз мумкин</i>'

        class client:
            passenger = f"Ариза ҳайдовчига жўнатилди, тасдиқлангандан сўнг сизга билдиришнома келади.\n\n" \
                        f"<b>Сиз бир нечта ҳайдовчиларга ариза юборишингиз мумкин, " \
                        f"аризани биринчи бўлиб қабул қилган киши билан йўлга чиқасиз.</b>\n\n" \
                        f"Яна танлайсизми?"
            accept = "✅ Ариза ҳайдовчи томонидан қабул қилинди"
            reject = '❌ Ариза ҳайдовчи томонидан рад этилди\n\n' \
                     'Бошқа ҳайдовчини танлашингиз мумкин 👇'
            info = "Сизнинг маълумотларингиз"

        class driver:
            driver = f'✅ Сизнинг аризангиз қабул қилинди. Йўловчилар жавоб беришлари билан сиз хабарнома оласиз.\n\n' \
                     f'<i>Буюртмалар ҳолатини <b>«🗓 Фаол Буюртмалар»</b> саҳифасида кузатишингиз мумкин</i> 👇'
            route_cancel = "❌ Фаолият бекор қилинди, мижозлар сизни бошқа ҳайдовчилар рўйхатида кўрмайди.\n\n" \
                           "❕Йўловчилар учун яна фаол бўлиш учун <b>«🚕 Йўлдаман»</b> тугмасини босинг."
            order = 'Буюртма ва мижоз маълумотларини олиш учун <b>«✅Қабул қилиш»</b> тугмасини босинг.'
            order_cost1 = 'Хизмат нархи '
            order_cost2 = 'сўмни ташкил этади, маблағ балансингиздан ечиб олинади.'
            accept = "✅ Ариза қабул қилинди, йўловчига буюртма қабул қилинганлиги ҳақида хабар бердик"
            reject = '❌ Ариза рад этилди'
            info = "Йўловчини ма’лумотлари"
            phone_client = "Телефон"
            new_order = "⚡ Янги йўловчи бор!"

    class cancel:
        class client:
            question_order = "Буюртмани бекор қилмоқчимисиз? Бу ҳаракатни қайтариб бўлмайди."
            order = "❌Бекор қилинди."
            delete = "❌ Афсуски, ҳайдовчи аризани бекор қилди"
            cancel = "❌ Ариза ҳайдовчи томонидан рад этилди"
            new_driver = "Бошқа ҳайдовчи танлашингиз мумкин 👇"

        class driver:
            passenger = '❌Йўловчи аризани бекор қилди, маблағ ҳамёнингизга қайтарилади'
            driver = "Ишончингиз комилми? Агар буюртма ҳайдовчи томонидан бекор қилинса маблағ " \
                     "балансингизга қайтарилмайди"
            order = "❌Бекор қилинди."

    class alert:
        wallet = "Балансингизда маблағингиз етарли эмас, балансингизни тўлдиринг." \
                             "🔑 Шахсий кабинет —> 💳 Баланс —> Балансни тўлдириш"

        class phone:
            alert = "Қайта уриниб кўринг 😅"

        class driver:
            accept_order_late = "❌ Мурожаат бошқа ҳайдовчи томонидан қабул қилинганлиги ёки аризага сизнинг " \
                                "тарафингиздан узоқ жавоб берилганлиги сабабли автоматик рад этилган"
            places_error =  "4 та жойдан ортиқ мавжуд жой йўқ"
            places_full = "Машина тўлган, биз йўловчиларга хабарнома юбордик"
            insufficient_funds = "Балансингизда маблағингиз етарли эмас, балансингизни тўлдиринг." \
                                 "🔑 Шахсий кабинет —> 💳 Баланс —> Балансни тўлдириш"
            insufficient_funds2 = "<b>⚠️Эслатма!\n\n" \
                                  "Кейинги буюртмани қабул қилиш учун балансингизда етарли маблағ йўқ, " \
                                  "фаол бўлиш учун балансингизни тўлдиринг"

    class car:
        car = {1: 'Cobalt', 2: 'Gentra', 3: 'Lacetti', 4: 'Nexia 1', 5: 'Nexia 2',
               6: 'Nexia 3', 7: 'Malibu 1', 8: 'Captiva', 9: 'Malibu 2', 10: 'Matiz',
               11: 'Spark', 12: 'Epica', 13: 'Damas', 14: 'Lada', 15: 'Иномарка'}
        color = {1: 'Оқ', 2: 'Қора', 3: 'Кумуш', 4: 'Тўқ кулранг ', 5: 'Молочний', 6: 'Гилос ранги',
                 7: 'Сариқ', 8: 'Қизил', 9: 'Яшил', 10: 'Кўк', 11: 'Мовий'}

    class active_order:
        no_active_order = "Ҳозирги пайтда фаол буюртмаларингиз йўқ"

    class rate:
        rate_5 = "😄 Баҳо учун раҳмат, сизга ҳаммаси ёқган бўлса биз хурсандмиз!"
        rate_4 = "😄 Баҳо учун раҳмат, сизга ҳаммаси ёқган бўлса биз хурсандмиз! Биз яхшироқ ҳаракат қиламиз."
        rate_3 = "😕 Баҳо учун раҳмат, ҳайдовчи сизнинг умидларингизни оқламагани учун узур. Умид қиламизки, " \
                 "кейинги сафар фақатгина ижобий ҳис-туйғулар қолдиради."
        rate_2 = "😐 Баҳо учун раҳмат, ҳайдовчи сизнинг умидларингизни оқламагани учун узур, унинг фаолиятини камайтирамиз."
        rate_1 = "😞 Баҳо учун раҳмат, ҳайдовчи сизнинг умидларингизни оқламагани учун узур, унинг фаолиятини камайтирамиз."
        rate_dict = {1: rate_1, 2: rate_2, 3: rate_3, 4: rate_4, 5: rate_5}

    class on_spot:
        common = "❗ Жўнаш жойига келганингизда <b>«📍 Мен жойдаман»</b> тугмасини босинг"
        client = "📍 Йўловчи жойда 👇"
        driver = "📍 Ҳайдовчи жойда 👇"
        on_spot = "📍 Жўнаш жойи 👆"
        inform_driver = "✅ Ҳайдовчига хабар бердик"
        inform_client = "✅ Йўловчиларга хабар бердик"
        time = "Жўнаш вақти"
        info = "Йўловчилар ма’лумоти"
        passenger = "Йўловчи"
        phone = "Телефон"
        places = "Йўловчилар"

    class option:
        yes = "Бор"
        no = "Йўқ"
        da = "Ха"
        option = {0: no, 1:yes}

    class quiz:
        main = "Айни пайтда Пайнет орқали тўлов уланмаган.\n\n" \
               "<b>Пайнет орқали ҳамёнингизни тўлдириш сизга қулайроқ бўладими?</b>👇"
        thanks = "Маълумот учун раҳмат, тез орада ушбу тўлов усулини қўшамиз."
        yes = "✅ Ҳа, қулайроқ"

    class reminder:
        client1 = "📣"
        client2 = "та дан ортиқ ҳайдовчилар бугун сизнинг йўналишингиз бойича йўлга чиқишмоқчи. " \
                  "Ўзингизга қулай ҳайдовчини топишга улгуринг! 👇"
        driver1 = "📣"
        driver2 = "та дан ортиқ йўловчилар бугун сизнинг йўналишингиз бойича йўлга чиқишмоқчи." \
                  "Фаол бўлишга улгуринг! \n\n" \
                  "Фаол болиш учун <b>«🚕 Йўловчилар керак»</b> тугмасини босинг 👇"